In [2]:
import pandas as pd

data = {
'Name': ['Employee_1', 'Employee_2', 'Employee_3', 'Employee_4', 'Employee_5', 
'Employee_6', 'Employee_7', 'Employee_8', 'Employee_9', 'Employee_10', 
'Employee_11', 'Employee_12', 'Employee_13', 'Employee_14', 'Employee_15', 
'Employee_16', 'Employee_17', 'Employee_18', 'Employee_19', 'Employee_20', 
'Employee_21', 'Employee_22', 'Employee_23', 'Employee_24', 'Employee_25', 
'Employee_26', 'Employee_27', 'Employee_28', 'Employee_29', 'Employee_30'],
'Salary': [54895.0, 38784.0, 120000.0, 60309.0, 46788.0, 
50598.0, 61915.0, 50651.0, 38155.0, 55480.0, 
49396.0, 64183.0, 38894.0, 46672.0, 20000.0, 
57935.0, 57055.0, 44719.0, 66267.0, 48339.0, 
44490.0, 48817.0, 39738.0, 59433.0, 80823.0, 
80000.0, 52704.0, 54168.0, 56569.0, 45481.0],
'Age': [49, 48, 34, 33, 59, 36, 34, 30, 36, 29, 
29, 54, 55, 29, 53, 34, 23, 41, 58, 41, 
45, 22, 39, 47, 22, 30, 53, 33, 23, 52],
'Function': ['HR', 'Sales', 'Manager', 'Manager', 'HR', 
'Sales', 'Manager', 'HR', 'Sales', 'HR', 
'Sales', 'Developer', 'Developer', 'Sales', 'HR', 
'Sales', 'Developer', 'Developer', 'HR', 'Sales', 
'HR', 'Manager', 'HR', 'Sales', 'HR', 'Sales', 
'Sales', 'Developer', 'Developer', 'HR']
}

In [3]:
# Convert to DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)
##---------------------------------------------------------------------------

           Name    Salary  Age   Function
0    Employee_1   54895.0   49         HR
1    Employee_2   38784.0   48      Sales
2    Employee_3  120000.0   34    Manager
3    Employee_4   60309.0   33    Manager
4    Employee_5   46788.0   59         HR
5    Employee_6   50598.0   36      Sales
6    Employee_7   61915.0   34    Manager
7    Employee_8   50651.0   30         HR
8    Employee_9   38155.0   36      Sales
9   Employee_10   55480.0   29         HR
10  Employee_11   49396.0   29      Sales
11  Employee_12   64183.0   54  Developer
12  Employee_13   38894.0   55  Developer
13  Employee_14   46672.0   29      Sales
14  Employee_15   20000.0   53         HR
15  Employee_16   57935.0   34      Sales
16  Employee_17   57055.0   23  Developer
17  Employee_18   44719.0   41  Developer
18  Employee_19   66267.0   58         HR
19  Employee_20   48339.0   41      Sales
20  Employee_21   44490.0   45         HR
21  Employee_22   48817.0   22    Manager
22  Employee_23   39738.0   39         HR
23  Employee_24   59433.0   47      Sales
24  Employee_25   80823.0   22         HR
25  Employee_26   80000.0   30      Sales
26  Employee_27   52704.0   53      Sales
27  Employee_28   54168.0   33  Developer
28  Employee_29   56569.0   23  Developer
29  Employee_30   45481.0   52         HR

In [4]:

# Define the department to code mapping
department_mapping = {
'HR': 'HR001',
'Sales': 'SAL002',
'Manager': 'MGR003',
'Developer': 'DEV004'
}

# Convert the dictionary to a DataFrame
department_df = pd.DataFrame(list(department_mapping.items()), columns=['Department', 'Department_Code'])

# Display the DataFrame
print(department_df)

  Department Department_Code
0         HR           HR001
1      Sales          SAL002
2    Manager          MGR003
3  Developer          DEV004

In [9]:
import numpy as np
bins=[0,20,30,40,50,np.inf]
labels=['<20 years','20-30 years','30-40 years','40-50 years','>50 years']
df['Age_Bucketed']=pd.cut(df['Age'],bins=bins,labels=labels,right=False)

In [10]:
df.head()

         Name    Salary  Age Function Age_Bucketed
0  Employee_1   54895.0   49       HR  40-50 years
1  Employee_2   38784.0   48    Sales  40-50 years
2  Employee_3  120000.0   34  Manager  30-40 years
3  Employee_4   60309.0   33  Manager  30-40 years
4  Employee_5   46788.0   59       HR    >50 years

In [11]:
df = df.merge(department_df, left_on='Function', right_on='Department', how='left')
# Drop the extra 'Department' column from the merge
df.drop('Department', axis=1, inplace=True)
df.rename(columns={'Department_Code': 'Function_Code'}, inplace=True)
print(df.head())

         Name    Salary  Age Function Age_Bucketed Function_Code
0  Employee_1   54895.0   49       HR  40-50 years         HR001
1  Employee_2   38784.0   48    Sales  40-50 years        SAL002
2  Employee_3  120000.0   34  Manager  30-40 years        MGR003
3  Employee_4   60309.0   33  Manager  30-40 years        MGR003
4  Employee_5   46788.0   59       HR    >50 years         HR001

In [12]:
Q1 = df['Salary'].quantile(0.25)
Q3 = df['Salary'].quantile(0.75)
IQR = Q3 - Q1

lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR
df['Outlier'] = df['Salary'].apply(lambda x: 'Outlier' if x < lower_bound or x > upper_bound else 'Not an Outlier')
print(df.head())

         Name    Salary  Age Function Age_Bucketed Function_Code  \
0  Employee_1   54895.0   49       HR  40-50 years         HR001
1  Employee_2   38784.0   48    Sales  40-50 years        SAL002
2  Employee_3  120000.0   34  Manager  30-40 years        MGR003
3  Employee_4   60309.0   33  Manager  30-40 years        MGR003
4  Employee_5   46788.0   59       HR    >50 years         HR001

          Outlier
0  Not an Outlier
1  Not an Outlier
2         Outlier
3  Not an Outlier
4  Not an Outlier